IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28002x_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="PARTIDL" width="32" page="1" offset="0x8" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="INSTASPIN" description="Instaspin feature set" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="FLASH_SIZE" description="Flash size in KB" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PARTIDH" width="32" page="1" offset="0xa" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="REVID" width="32" page="1" offset="0xc" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID. This is specific to the Device" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DC21" width="32" page="1" offset="0x3a" internal="0" description="Device Capability: CLB">
		<bitfield id="CLB1" description="CLB1 Present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Present" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="FUSEERR" width="32" page="1" offset="0x74" internal="0" description="e-Fuse error Status register">
		<bitfield id="ALERR" description="Efuse Autoload Error Status" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="ERR" description="Efuse Self Test Error Status" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="SOFTPRES0" width="32" page="1" offset="0x82" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPU1_CPUBGCRC" description="CPUBGCRC Module reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ERAD" description="ERAD Module reset bit" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES2" width="32" page="1" offset="0x86" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES3" width="32" page="1" offset="0x88" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES4" width="32" page="1" offset="0x8a" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES7" width="32" page="1" offset="0x90" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SCI_A" description="SCI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES8" width="32" page="1" offset="0x92" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES9" width="32" page="1" offset="0x94" internal="0" description="Peripheral Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES10" width="32" page="1" offset="0x96" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CAN_A" description="CAN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES13" width="32" page="1" offset="0x9c" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES14" width="32" page="1" offset="0x9e" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES17" width="32" page="1" offset="0xa4" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CLB1" description="CLB1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES18" width="32" page="1" offset="0xa6" internal="0" description="Peripheral Software Reset register">
	</register>
	<register id="SOFTPRES19" width="32" page="1" offset="0xa8" internal="0" description="Peripheral Software Reset register">
		<bitfield id="LIN_A" description="LIN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES20" width="32" page="1" offset="0xaa" internal="0" description="Peripheral Software Reset register">
		<bitfield id="PMBUS_A" description="PMBUS_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES21" width="32" page="1" offset="0xac" internal="0" description="Peripheral Software Reset register">
		<bitfield id="DCC0" description="DCC Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES25" width="32" page="1" offset="0xb4" internal="0" description="Peripheral Software Reset register">
		<bitfield id="HIC_A" description="HIC Slave and Host controller Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="TAP_STATUS" width="32" page="1" offset="0x130" internal="0" description="Status of JTAG State machine and Debugger Connect">
		<bitfield id="TAP_STATE" description="Present TAP State" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger Connect Indication" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="ECAPTYPE" width="16" page="1" offset="0x19b" internal="0" description="Configures ECAP Type for the device">
		<bitfield id="TYPE" description="Configure ECAP type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit for the register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
